# x = int(input("enter a number: "))

# if x > 100:
#     print("number is greater than 100")
# else:
#     print("number is less than 100")

# res = "number is greater than 100" if x >= 100 else "number is less than 100"
# print(res)
# x = 1.9
# print(int(x))
# print(str(x) + "salaam")
x = "m"
print(ord(x))
y = 109
print(chr(y))
# تمرین
# با کمک حلقه فور برنامه ای بنویسید که معادل عددی تک تک کاراکترهای اسم شما را نمایش دهد
# برنامه ای بنویسید که یه اسم از ورودی دریافت نماید و معادل عددی تک تک کاراکترهای آن را نمایش دهد
# سپس مجموع عددی تک تک کاراکترهای آن اسم را نیز محاسبه کنید

# samane      115 97 109 97 108 101
# کارهای بالا را با استفاده از حلقه وایل انجام دهید
# تمرین
s = "14680132458904"
# برنامه ای بنویسید که با کمک حلقه فور مجموع اعداد موجود در رشته بالا را محاسبه نماید و با هم جمع کند
# برنامه ای بنویسید که فقط عددهای زوج موجود در متن بالا را با هم جمع نماید و حاصل را نمایش دهد
# تمرین
s = "abnmpoiuanmopanhhgsrsaaap,mnghjkmnna"
# برنامه ای بنویسید که تعداد کاراکترهای زیر را در رشته بالا نمایش دهد
# a
# n